Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: As a result, certain classes, such as `HttpServletRequest` are not always available for injection. Most use-cases for this particular class are covered by JAX-RS equivalents, except for getting the remote client's IP. RESTEasy comes with a replacement API which you can inject: https://docs.jboss.org/resteasy/docs/4.5.6.Final/javadocs/org/jboss/resteasy/spi/HttpRequest.html[`HttpRequest`], which has the methods https://docs.jboss.org/resteasy/docs/4.5.6.Final/javadocs/org/jboss/resteasy/spi/HttpRequest.html#getRemoteAddress--[`getRemoteAddress()`] and https://docs.jboss.org/resteasy/docs/4.5.6.Final/javadocs/org/jboss/resteasy/spi/HttpRequest.html#getRemoteHost--[`getRemoteHost()`] to solve this problem.
ja_jp: その結果、 `HttpServletRequest` のような特定のクラスが常にインジェクションに利用できるわけではありません。この特定のクラスのほとんどのユースケースは、リモートクライアントの IP を取得することを除いて、JAX-RS と同等のものでカバーされています。RESTEasy には、インジェクション可能な代替 API が付属しています。 link:https://docs.jboss.org/resteasy/docs/4.5.6.Final/javadocs/org/jboss/resteasy/spi/HttpRequest.html[`HttpRequest`] これは以下のメソッドを持っています。 link:https://docs.jboss.org/resteasy/docs/4.5.6.Final/javadocs/org/jboss/resteasy/spi/HttpRequest.html#getRemoteAddress--[`getRemoteAddress()`] そして link:https://docs.jboss.org/resteasy/docs/4.5.6.Final/javadocs/org/jboss/resteasy/spi/HttpRequest.html#getRemoteHost--[`getRemoteHost()`] を解決するために、この問題を解決します。

source: As a result, certain classes, such as `HttpServletRequest` are not always available for injection. Most use-cases for this particular class are covered by Jakarta REST equivalents, except for getting the remote client's IP. RESTEasy comes with a replacement API which you can inject: https://docs.jboss.org/resteasy/docs/4.5.6.Final/javadocs/org/jboss/resteasy/spi/HttpRequest.html[`HttpRequest`], which has the methods https://docs.jboss.org/resteasy/docs/4.5.6.Final/javadocs/org/jboss/resteasy/spi/HttpRequest.html#getRemoteAddress--[`getRemoteAddress()`] and https://docs.jboss.org/resteasy/docs/4.5.6.Final/javadocs/org/jboss/resteasy/spi/HttpRequest.html#getRemoteHost--[`getRemoteHost()`] to solve this problem.
ja_jp: その結果、 `HttpServletRequest` のような特定のクラスは、常に注入可能ではありません。この特定のクラスのほとんどのユースケースは、リモートクライアントのIPを取得することを除いて、Jakarta RESTの同等のものでカバーされています。RESTEasyには、注入可能な代替APIが付属しています： link:https://docs.jboss.org/resteasy/docs/4.5.6.Final/javadocs/org/jboss/resteasy/spi/HttpRequest.html[HttpRequest] これは、link:https://docs.jboss.org/resteasy/docs/4.5.6.Final/javadocs/org/jboss/resteasy/spi/HttpRequest.html#getRemoteAddress--[getRemoteAddress()] メソッドと link:https://docs.jboss.org/resteasy/docs/4.5.6.Final/javadocs/org/jboss/resteasy/spi/HttpRequest.html#getRemoteHost--[getRemoteHost()] メソッドを持っており、この問題を解決することができます。

source: As a result, you can still access the MDC data in various scenarios:
ja_jp: その結果、さまざまなシナリオでMDCデータにアクセスすることができます:

source: As a result:
ja_jp: 上記の結果として、以下のようになります。

source: As a rule, the version set here should be as high as possible, but must be lower than or equal to the version of any database your application will connect to.
ja_jp: 原則として、ここで設定するバージョンはできるだけ高くする必要がありますが、 アプリケーションが接続するデータベースのバージョン以下である必要があります。

source: As a string it will look like `<platform-bom-groupId>:<platform-bom-artifactId>-quarkus-platform-descriptor:<platform-version>:json:<platform-version>`
ja_jp: 文字列としては次のようになります： `<platform-bom-groupId>:<platform-bom-artifactId>-quarkus-platform-descriptor:<platform-version>:json:<platform-version>`

source: As a test annotated with `@QuarkusIntegrationTest` tests the result of the build, it should be run as part of the integration test suite - i.e. by setting `-DskipITs=false` if using Maven or the `quarkusIntTest` task if using Gradle. These tests will **not** work if run in the same phase as `@QuarkusTest` as Quarkus has not yet created the final artifact.
ja_jp: `@QuarkusIntegrationTest` でアノテーションが付けられたテストはビルドの結果をテストするため、統合テストスイートの一部として実行する必要があります。 - 例えば、Maven を使用している場合は `-DskipITs=false` を設定し、Gradle を 使用している場合は `quarkusIntTest` タスクを設定します。これらのテストは、Quarkus がまだ最終のアーティファクトを作成していないため、 `@QuarkusTest` と同じフェーズで実行すると **機能しません**。

source: As a test annotated with `@QuarkusIntegrationTest` tests the result of the build, it should be run as part of the integration test suite - i.e. via the `maven-failsafe-plugin` if using Maven or an additional task if using Gradle. These tests will **not** work if run in the same phase as `@QuarkusTest` as Quarkus has not yet created the final artifact.
ja_jp: `@QuarkusIntegrationTest` でアノテーションされたテストは、ビルドの結果をテストするので、統合テストスイートの一部として、つまり、Maven を使用している場合は `maven-failsafe-plugin` を介して、Gradle を使用している場合は追加タスクとして実行する必要があります。Quarkusはまだ最終的な成果物を作成していないため、 `@QuarkusTest` と同じフェーズで実行しても、これらのテストは機能 *しません* 。

source: As above, commands can be stacked. The only requirement is that `native` be the first parameter should you wish to work with native image builds. The script will take care of the rest of the details necessary to manage your native image function deployments.
ja_jp: 上記のように、コマンドはスタックすることができます。唯一の要件は、ネイティブイメージビルドで作業したい場合、最初のパラメーターとして `native` を指定することです。このスクリプトは、ネイティブイメージ Function のデプロイメントを管理するために必要な残りの詳細を処理します。

source: As already explained in the <<delay-class-init-in-your-app, delay class initialization>> section, Quarkus marks all code to be initialized at build time by default. This means that, unless marked otherwise, static variables will be assigned at build time, and static blocks will be executed at build time too.
ja_jp: <<delay-class-init-in-your-app, 遅延クラス初期化>> セクションですでに説明したように、Quarkus はデフォルトでビルド時にすべてのコードを初期化するようマークします。つまり、特に指定がない限り、静的変数はビルド時に代入され、静的ブロックもビルド時に実行されます。

source: As already explained in the <<delay-class-init-in-your-app,delay class initialization>> section, Quarkus marks all code to be initialized at build time by default. This means that, unless marked otherwise, static variables will be assigned at build time, and static blocks will be executed at build time too.
ja_jp: <<delay-class-init-in-your-app,delay class initialization>> セクションですでに説明したように、Quarkus はデフォルトでビルド時にすべてのコードを初期化するようマークします。つまり、特に指定がない限り、静的変数はビルド時に代入され、静的ブロックもビルド時に実行されます。

source: As already explained in the xref:delay-class-init-in-your-app[delay class initialization] section, Quarkus marks all code to be initialized at build time by default. This means that, unless marked otherwise, static variables will be assigned at build time, and static blocks will be executed at build time too.
ja_jp: xref:delay-class-init-in-your-app[遅延クラスの初期化]で 説明したように、Quarkusはデフォルトですべてのコードをビルド時に初期化するようマークします。つまり、特にマークされていない限り、静的変数はビルド時に割り当てられ、静的ブロックもビルド時に実行されることになります。

source: As already noted above, please use `AccessTokenRequestFilter` if you work with Keycloak or OpenID Connect Provider which supports a Token Exchange protocol.
ja_jp: 前述のように、Token Exchange プロトコルをサポートする Keycloak または OpenID Connect プロバイダーを使用する場合は、 `AccessTokenRequestFilter` を使用してください。

source: As always, if you spot issues or oddities, please let us know on https://quarkusio.zulipchat.com/[zulip] or https://github.com/quarkusio/quarkus/issues[raise an issue].
ja_jp: いつものように、問題や奇妙な点に気づいた場合は、 https://quarkusio.zulipchat.com/[zulip] で知らせるか、 https://github.com/quarkusio/quarkus/issues[イシューを起票] してください。

source: As an added precaution, we do recommend auditing your application dependencies and/or setting the `log4j2.formatMsgNoLookups` system property to `true`. The latter will prevent any unintentional inclusion of this vulnerability. A simple way to do this is to add `-Dlog4j2.formatMsgNoLookups=true` to the Quarkus command line.
ja_jp: さらに、アプリケーションの依存関係を監査したり、 `log4j2.formatMsgNoLookups` システムプロパティを `true` に設定したりすることをお勧めします。後者は、この脆弱性が意図せずに含まれてしまうことを防ぎます。これを行う簡単な方法は、Quarkusのコマンドラインに `-Dlog4j2.formatMsgNoLookups=true` を追加することです。

source: As an alternative to using Elasticsearch as a primary datastore, this extension can also be used to index entities coming from another datastore.
ja_jp: Elasticsearch をプライマリーデータストアとして使用する代わりとして、 このエクステンションは、別のデータストアから取得したエンティティーのインデックスを作成するためにも使用できます。

source: As an application developer, you build and deploy your {project-name} applications to {openshift} in a single step. Complete one of the following commands:
ja_jp: アプリケーション開発者として、{project-name}アプリケーションをビルドし、{openshift}にデプロイします。 以下のコマンドのいずれかを実行してください：

source: As an application developer, you can deploy your applications to {openshift} by using the Docker build strategy as a deployment option.
ja_jp: アプリケーション開発者として、デプロイオプションとしてDockerビルドストラテジーを使用することで、アプリケーションを {openshift} にデプロイすることができます。

source: As an application developer, you can deploy your {project-name} applications to {openshift-long}. The `quarkus-openshift` extension provides this functionality, which supports multiple deployment options:
ja_jp: アプリケーション開発者として、{project-name} アプリケーションを {openshift-long} にデプロイできます。`quarkus-openshift` エクステンションは、この機能を提供し、複数のデプロイオプションをサポートしています。

source: As an application developer, you can deploy your {project-name} applications to {openshift-long}. This functionality is provided by the `quarkus-openshift` extension, which supports multiple deployment options:
ja_jp: アプリケーション開発者として、{project-name} アプリケーションを {openshift-long} にデプロイすることができます。 この機能は `quarkus-openshift` エクステンションによって提供され、複数のデプロイオプションをサポートしています：

source: As an aside, how we got into this situation is not helped by differences in how libraries behave. Vert.x always wants segments beginning with leading slashes when creating routes, for example, while JAX-RS effectively ignores leading slashes in `@Path` annotations. Anyone used to Vert.x always adds leading slashes, and anyone using JAX-RS just does whatever and it magically works.
ja_jp: 余談ですが、どのようにしてこのような状況になったかというと、ライブラリの挙動の違いによるものではありません。Vert.x は、例えばルートを作成する際に、常に先頭のスラッシュで始まるセグメントを求めますが、JAX-RS は `@Path` のアノテーションでは先頭のスラッシュを事実上無視します。Vert.x に慣れている人は常に先頭のスラッシュを追加し、JAX-RS を使用している人は何をしても魔法のように動作します。

source: As an example, if an extension configures a `service` path, that endpoint will be served from `${quarkus.http.root-path}/service`. If you change the configuration of that path to `/service`, that endpoint will be served from `/service`.
ja_jp: 例として、エクステンションが `service` というパスを設定した場合、そのエンドポイントは `${quarkus.http.root-path}/service` から提供されます。 そのパスの設定を `/service` に変更した場合、そのエンドポイントは `/service` から提供されるようになります。

source: As an example, if you export the metrics to Prometheus, you will get:
ja_jp: 例えば、メトリクスをPrometheusにエクスポートすると、以下のように取得できます。

source: As an example, in order to register all methods of class `com.acme.MyClass` for reflection, we create `reflect-config.json` (the most common location is within `src/main/resources`)
ja_jp: たとえば、クラス `com.acme.MyClass` のすべてのメソッドをリフレクション用に登録するには、`reflect-config.json` を作成します (最も一般的な場所は `src/main/resources` 内です)。

source: As an example, in order to register all methods of class `com.acme.MyClass` for reflection, we create `reflection-config.json` (the most common location is within `src/main/resources`)
ja_jp: 例えば、クラス `com.acme.MyClass` のすべてのメソッドをリフレクションのために登録するには、 `reflection-config.json` を作成します (最も一般的な場所は `src/main/resources` の中です)。

source: As an example, suppose we have an interceptor that clears a cache. The corresponding interceptor binding would be called `@CacheInvalidateAll` and would be declared as `@Repeatable`. If we wanted to clear two caches at the same time, we would add `@CacheInvalidateAll` twice:
ja_jp: たとえば、キャッシュをクリアするインターセプタ―があるとします。対応するインターセプタ―バインディングは `@CacheInvalidateAll` と呼ばれ、 `@Repeatable` として宣言されます。同時に 2 つのキャッシュをクリアしたい場合は、 `@CacheInvalidateAll` を 2 回追加します。

source: As an example, the Arc Beans are rendered using a https://vaadin.com/docs/latest/components/grid[Vaadin Grid]:
ja_jp: たとえば、Arc Beans は https://vaadin.com/docs/latest/components/grid[Vaadin Grid] を使用してレンダリングされます。

source: As an example, the `@Timed` annotation from Micrometer is used to measure the execution time of a method:
ja_jp: たとえば、Micrometer の `@Timed` アノテーションは、メソッドの実行時間を測定するために使用します。

source: As an example, the only reason that a Quarkus application should load an XML parser is if the user is using XML in their application. Any XML parsing of configuration should be done in the Augmentation phase.
ja_jp: 例として、QuarkusアプリケーションがXMLパーサーをロードする理由は、ユーザーがアプリケーションでXMLを使用している場合のみです。どの設定のXMLパースも、拡張フェーズで行う必要があります。

source: As an example, to ensure the `example-namespace` namespace is present in the dev service, create the file `/src/main/resources/kubernetes/namespace.yml`:
ja_jp: 例として、`example-namespace` 名前空間が dev service に存在することを確認するには、`/src/main/resources/kubernetes/namespace.yml` ファイルを作成します。

source: As an example, we will implement a straightforward HTTP application. Nothing fancy:
ja_jp: 例として、簡単な HTTP アプリケーションを実装します。派手なものは何もありません:

source: As an optional hint, the type of keystore can be provided as one of the options listed. If the type is not provided, Quarkus will try to deduce it from the file extensions, defaulting to type JKS.
ja_jp: オプションのヒントとして、キーストアのタイプは、リストされているオプションの 1 つとして提供することができます。タイプが指定されていない場合、Quarkus はファイル拡張子からキーストアのタイプの推測を試行し、デフォルトでは JKS タイプになります。

source: As an optional hint, the type of keystore can be provided as one of the options listed. If the type is not provided, Quarkus will try to deduce it from the file extensions.
ja_jp: オプションのヒントとして、キーストアのタイプをオプションの1つとして指定できます。 タイプが指定されていない場合、Quarkusはファイルの拡張子から推測しようとします。

source: As and example, let's add a new extension called `my-ext` to the Quarkus source tree:
ja_jp: 例として、 `my-ext` という新しいエクステンションをQuarkusのソースツリーに追加してみましょう:

source: As another example, if you want to load all the rows you just inserted, you must concatenate the contents of each `RowSet`:
ja_jp: 別の例として、挿入したばかりのすべての行をロードする場合は、各 `RowSet` の内容を連結する必要があります。

source: As before, the UI is exposed on http://localhost:8080/quotes.html
ja_jp: 以前と同様に、UI は http://localhost:8080/quotes.html で公開されています

source: As by default, `MongoClient` is configured to access a local MongoDB database on port 27017 (the default MongoDB port), if you have a local running database on this port, there is nothing more to do before being able to test it!
ja_jp: デフォルトでは、 `MongoClient` はポート 27017 (デフォルトの MongoDB ポート) でローカルの MongoDB データベースにアクセスするように設定されています。このポートで実行されているローカルのデータベースがある場合は、他に何もする必要はありません!

source: As by default, the Elasticsearch client is configured to access a local Elasticsearch cluster on port 9200 (the default Elasticsearch port), if you have a local running instance on this port, there is nothing more to do before being able to test it!
ja_jp: デフォルトでは、Elasticsearchクライアントはポート9200(Elasticsearchのデフォルトポート)でローカルのElasticsearchクラスターにアクセスするように設定されているので、このポートでローカルで実行中のインスタンスがある場合、テストできるようにするためにやるべきことは何もありません!

source: As command mode applications will often require arguments to be passed on the command line, this is also possible in dev mode:
ja_jp: コマンドモードのアプリケーションでは、コマンドラインで引数を渡す必要があることが多く、これは開発モードでも可能です:

source: As content evolves, you might want to restructure an existing piece of Quarkus content into one or more content types and retire the existing AsciiDoc source file.
ja_jp: コンテンツの進化に伴い、既存のQuarkusコンテンツを1つまたは複数のコンテンツタイプに再編成し、既存のAsciiDocソースファイルを破棄したい場合があります。

source: As described above, the version can either be preconfigured explicitly via a `quarkus.datasource.db-version` configuration property, or implicitly set by the Quarkus build process to a minimum supported version of the database. Quarkus will try to check this preconfigured version against the actual database version on startup, leading to a startup failure when the actual version is lower.
ja_jp: 上述したように、このバージョンは `quarkus.datasource.db-version` 設定プロパティーを介して明示的に事前設定されるか、 または、Quarkus ビルドプロセスによって、データベースのサポートされている最小バージョンに暗黙的に設定されます。 Quarkus は起動時にこの事前設定されたバージョンと実際のデータベースバージョンを比較しようとします。 これにより、実際のバージョンが低い場合に起動に失敗します。

source: As described in detail link:https://github.com/quarkusio/quarkus/blob/main/adr/0004-using-the-tls-registry-for-clients.adoc#configuring-clients-with-the-tls-registry[here], Quarkus client extensions (such as REST, GRPC, and so on) ignore properties defined in default (that is, unnamed) TLS configurations. The `quarkus.tls.trust-all` property is the only exception.
ja_jp: link:https://github.com/quarkusio/quarkus/blob/main/adr/0004-using-the-tls-registry-for-clients.adoc#configuring-clients-with-the-tls-registry[こちら] で詳しく説明されているように、Quarkus のクライアントエクステンション (REST、gRPC など) は、デフォルトの (つまり名前のない) TLS 設定で定義されたプロパティーを無視します。`quarkus.tls.trust-all` プロパティーが唯一の例外です。

source: As described in link:{quarkus-home-url}/guides/extension-metadata#extension-offerings[Extension offering metadata], extensions may be associated with a one or more offerings delivered and supported by a dedicated team or an organization.
ja_jp: link:{quarkus-home-url}/guides/extension-metadata#extension-offerings[エクステンションオファリングメタデータ] に記載されているように、エクステンションは、専門チームまたは組織によって提供およびサポートされる1つ以上のオファリングに関連付けられる場合があります。

source: As described in link:{quarkus-home-url}/guides/extension-registry-user#limiting-extension-catalog-to-an-offering[the registry client documentation], an extension catalog could be limited to a specific extension offering delivered and supported by a dedicated team or an organization.
ja_jp: link:{quarkus-home-url}/guides/extension-registry-user#limiting-extension-catalog-to-an-offering[レジストリークライアントのドキュメント]に記載されているように、エクステンションカタログは、専任のチームまたは組織によって提供およびサポートされる特定のエクステンションオファリングに限定できます。

source: As described in the xref:performance-measure.adoc[Measuring Performance guide], the footprint of Quarkus applications is measured using the resident set size (RSS). This is also applicable to native applications, but the runtime engine that manages the footprint in this case is built in the native executable itself rather than the JVM.
ja_jp: xref:performance-measure.adoc[パフォーマンスの測定ガイド] で説明したように、Quarkusアプリケーションのフットプリントは、resident set size（RSS）を使用して測定されます。これはネイティブアプリケーションにも適用可能ですが、この場合のフットプリントを管理するランタイムエンジンは、JVMではなく、ネイティブ実行可能ファイル自体に組み込まれています。

source: As described in the <<authorization-code-flow-spa>> section, Quarkus OIDC can return an error to initiate an authorization code flow for SPA to intercept it and work around the fact that some OIDC providers do not support CORS for the authorization endpoint.
ja_jp: <<authorization-code-flow-spa>> セクションで説明されているように、一部の OIDC プロバイダーが認可エンドポイントの CORS をサポートしていないという事実に対処するため、Quarkus OIDC はエラーを返して SPA の認可コードフローを開始し、それをインターセプトすることができます。

source: As discussed in the <<token-roles>> section above, a token `groups` claims is used by default to check the identity roles, and custom claims containing the roles can also be selected with the configuration. However, additional customization and checks may be required in order to correctly determine the roles and permissions associated with the current token identity.
ja_jp: 上記の <<token-roles>> セクションで説明したように、デフォルトではトークンの `groups` クレームがアイデンティティーロールのチェックに使用されます。また、ロールを含むカスタムクレームを設定で選択することもできます。ただし、現在のトークンアイデンティティーに関連付けられたロールと権限を正しく判断するために、追加のカスタマイズやチェックが必要になる場合があります。

source: As discussed in the <<token-state-manager>> section above, Quarkus OIDC already provides stateless (default) and stateful options for storing authorization code flow tokens. You can also provide your own custom `io.quarkus.oidc.TokenStateManager` implementation.
ja_jp: 上記の <<token-state-manager>> セクションで説明したように、Quarkus OIDC は、認可コードフロートークンを保存するためのステートレス (デフォルト) およびステートフルなオプションをすでに提供しています。独自のカスタム `io.quarkus.oidc.TokenStateManager` 実装を提供することもできます。

source: As documented in link:https://github.com/quarkusio/quarkus/issues/36265[issue #36265], Oracle unexpectedly commits uncommitted transactions when closing a connection. This means that when stopping Quarkus, in-progress transactions might be committed even if they are incomplete.
ja_jp: link:https://github.com/quarkusio/quarkus/issues/36265[issue #36265] で文書化されているように、Oracleでは接続を閉じるときにコミットされていないトランザクションが予期せずコミットされます。 つまり、Quarkusを停止すると、進行中のトランザクションが不完全であってもコミットされる可能性があります。

source: As documented in xref:lifecycle.adoc#startup_annotation[the `@Startup` method documentation], you may define startup methods that return a `Uni`, in which case they will be invoked on an event thread instead of a blocking thread, and their returned `Uni` will be subscribed to and awaited.
ja_jp: xref:lifecycle.adoc#startup_annotation[`@Startup` メソッドのドキュメント] に記載されているように、`Uni` を返すスタートアップ メソッドを定義できます。この場合、ブロッキング スレッドではなくイベント スレッドで呼び出され、返された `Uni` はサブスクライブされて待機されます。

source: As expected, Quarkus excelled in memory consumption and startup time. But the build time was noticeably higher than Spring Boot's. Again, this wasn't a surprise. After all, Quarkus shifts more work to build time. But the difference was still significant enough to warrant a closer look.
ja_jp: 予想どおり、Quarkusはメモリー消費と起動時間で優れていました。しかし、ビルド時間はSpring Bootよりも著しく高かったです。これもまた驚くことではありませんでした。結局のところ、Quarkusはより多くの作業をビルド時に移行します。しかし、その差はそれでも詳しく調べるに値するほど大きかったのです。

source: As explained above, Quarkus takes care of all the heavy lifting when coming to the AOT file generation. However, in cases where more control is needed, users can perform the necessary steps manually.
ja_jp: 上述の通り、AOT ファイルの生成に関しては Quarkus がすべての面倒な作業を引き受けます。ただし、より細かな制御が必要な場合は、ユーザーが必要な手順を手動で実行することもできます。

source: As explained above, this extension allows you to inject many types of beans:
ja_jp: 上記のように、このエクステンションを使用すると、多くの種類の Bean を注入できます:

source: As explained earlier in the <<caching,Caching section>>, you don't need to pick an implementation. A suitable implementation based on technologies from link:https://infinispan.org/[Infinispan] and link:https://github.com/ben-manes/caffeine[Caffeine] is included as a transitive dependency of the Hibernate ORM extension, and automatically integrated during the build.
ja_jp: 前述の <<caching,Caching section>> で説明したように、実装を選択する必要はありません。 link:https://infinispan.org/[Infinispan] と link:https://github.com/ben-manes/caffeine[Caffeine] の技術に基づく適切な実装が Hibernate ORM エクステンションの遷移依存関係として含まれており、ビルド時に自動的に統合されます。

source: As explained earlier in the xref:caching[Caching section], you don't need to pick an implementation. A suitable implementation based on technologies from link:https://infinispan.org/[Infinispan] and link:https://github.com/ben-manes/caffeine[Caffeine] is included as a transitive dependency of the Hibernate ORM extension, and automatically integrated during the build.
ja_jp: 先に xref:caching[キャッシュのセクション] で説明したように、実装を選ぶ必要はありません。 link:https://infinispan.org/[Infinispan] と link:https://github.com/ben-manes/caffeine[Caffeine] の技術に基づいた適切な実装が、Hibernate ORMエクステンションの推移的依存関係として含まれ、ビルド中に自動的に統合されます。

source: As explained in https://access.redhat.com/documentation/en-us/red_hat_openshift_streams_for_apache_kafka/1/guide/88e1487a-2a14-4b35-85b9-a7a2d67a37f3[Getting started with the rhoas CLI for Red Hat OpenShift Streams for Apache Kafka], to use Red Hat OpenShift Streams for Apache Kafka, you must create the topic beforehand, create a _Service Account_, and provide permissions to read and write to your topic from that service account. The authentication data (client id and secret) relates to the service account, which means you can implement fine-grain permissions and restrict access to the topic.
ja_jp: https://access.redhat.com/documentation/en-us/red_hat_openshift_streams_for_apache_kafka/1/guide/88e1487a-2a14-4b35-85b9-a7a2d67a37f3[Getting started with the rhoas CLI for Red Hat OpenShift Streams for Apache Kafka] で説明されているように、Red Hat OpenShift Streams for Apache Kafka を使用するには、事前にトピックを作成し、_Service Account_ を作成し、そのサービスアカウントからトピックの読み取りと書き込みを行うためのパーミッションを提供する必要があります。認証データ (クライアント ID とシークレット) はサービスアカウントに関連しています。つまり、詳細なアクセスパーミッションを実装し、トピックへのアクセスを制限できます。

source: As far as Quarkus endpoints are concerned, they can continue using the same Quarkus Security and OIDC API annotations, such as `@Authenticated`, `SecurityIdentity`, and so on.
ja_jp: Quarkus エンドポイントに関しては、同じ Quarkus Security と OIDC API アノテーション (例: `@Authenticated`、 `SecurityIdentity` など) を引き続き使用できます。
